Observable Trends from Analysised School Test Scores Data

Schools spending $615 or more per student are underperforming in each element compared to schools spending less than $615 per student. More analysis needs to be done to see if schools with a lower per student spend are using their resources efficiently or if schools with larger per student spend have wasted spending.

Large schools (2,000 to 5,000 students) perform worse in each element compared to small (less than 1,000 students) and medium (1,000 to 2,000) sized schools. There is an especially noticeable difference in terms of passing rate for math, reading and overall.

Charter schools make up the top five performing schools in the district while District schools make up the bottom five performing schools. Charter schools outperform District schools across the board. This could be due to several factors such as staff to student ratio, efficient spending or school size. More analysis needs to be performed to see what may be scalable to the underperforming schools.

In [1]:
#dependencies
import pandas as pd

In [2]:
#create file paths
raw_school_data = "Resources/schools_complete.csv"
raw_student_data = "Resources/students_complete.csv"

In [3]:
#put raw data in dataframe
school_df = pd.read_csv(raw_school_data)
student_df = pd.read_csv(raw_student_data)

In [4]:
#show school dataframe
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
#show student dataframe 
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
merge_school_student = pd.merge(school_df, student_df, on='school_name')
merge_school_student.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [7]:
#rename columns
renamed_columns = merge_school_student.rename(columns={'school_name': 'School Name', 'type': 'School Type',
                                                       'size': 'School Size', 'budget': 'School Budget',
                                                       'student_name': 'Student Name', 'gender': 'Gender',
                                                       'grade': 'Grade', 'reading_score': 'Reading Score', 
                                                       'math_score':'Math Score'})
renamed_columns.head()

,School ID,School Name,School Type,School Size,School Budget,Student ID,Student Name,Gender,Grade,Reading Score,Math Score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [8]:
#count schools
unique_schools = renamed_columns['School Name'].nunique()
unique_schools

15

In [9]:
#calculate students in district
district_student = school_df['size'].sum()
district_student

39170

In [10]:
#calculate district budget
district_budget = school_df['budget'].sum()
district_budget

24649428

In [11]:
#calculate district avg math score
dist_avg_math = renamed_columns['Math Score'].mean()
dist_avg_math

78.98537145774827

In [12]:
#calculate district avg reading score
dist_avg_reading = renamed_columns['Reading Score'].mean()
dist_avg_reading

81.87784018381414

In [13]:
#calculate district percentage passing math
dist_pass_math = (renamed_columns[renamed_columns['Math Score'] >= 70].count()['Student Name'] * 100) / district_student
dist_pass_math

74.9808526933878

In [14]:
#calculate district percentage passing reading
dist_pass_reading = (renamed_columns[renamed_columns['Reading Score'] >= 70].count()['Student Name'] * 100) / district_student
dist_pass_reading

85.80546336482001

In [15]:
#calculate district overall passing
dist_pass_overall = (dist_pass_math + dist_pass_reading) / 2
dist_pass_overall

80.39315802910392

In [16]:
#district summary dataframe
district_data = [{'Total Schools': unique_schools, 'Total Students': district_student, 'Total Budget': district_budget, 
                     'Average Math Score': dist_avg_math, 'Average Reading Score': dist_avg_reading, 
                     '% Passing Math': dist_pass_math, '% Passing Reading': dist_pass_reading, 
                     '% Overall Passing': dist_pass_overall}]

district_summary = pd.DataFrame(district_data)
district_summary

,% Overall Passing,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Schools,Total Students
0,80.393158,74.980853,85.805463,78.985371,81.87784,24649428,15,39170

In [17]:
#reorganize summary to make sense
reorganized_district_summary = district_summary[['Total Schools', 'Total Students', 'Total Budget', 
                                                 'Average Math Score', 'Average Reading Score', 
                                                 '% Passing Math', '% Passing Reading', '% Overall Passing']]

reorganized_district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.393158

In [18]:
##final dataframe for district summary breakdown
#format district summary table
reorganized_district_summary['Total Students'] = reorganized_district_summary['Total Students'].map('{:,}'.format)
reorganized_district_summary['Total Budget'] = reorganized_district_summary['Total Budget'].map('${:,}'.format)
reorganized_district_summary['Average Math Score'] = reorganized_district_summary['Average Math Score'].map('{:.2f}'.format)
reorganized_district_summary['Average Reading Score'] = reorganized_district_summary['Average Reading Score'].map('{:.2f}'.format)
reorganized_district_summary['% Passing Math'] = reorganized_district_summary['% Passing Math'].map('{:.2f}%'.format)
reorganized_district_summary['% Passing Reading'] = reorganized_district_summary['% Passing Reading'].map('{:.2f}%'.format)
reorganized_district_summary['% Overall Passing'] = reorganized_district_summary['% Overall Passing'].map('{:.2f}%'.format)

reorganized_district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428",78.99,81.88,74.98%,85.81%,80.39%

In [19]:
#group by school name
grouped_school = renamed_columns.groupby(['School Name'])

avg_scores = grouped_school.mean()

avg_scores.head()

,School ID,School Size,School Budget,Student ID,Reading Score,Math Score
School Name,,,,,,
Bailey High School,7.0,4976.0,3124928.0,20358.5,81.033963,77.048432
Cabrera High School,6.0,1858.0,1081356.0,16941.5,83.975780,83.061895
Figueroa High School,1.0,2949.0,1884411.0,4391.0,81.158020,76.711767
Ford High School,13.0,2739.0,1763916.0,36165.0,80.746258,77.102592
Griffin High School,4.0,1468.0,917500.0,12995.5,83.816757,83.351499

In [20]:
#count students per school
sch_students = renamed_columns['School Name'].value_counts()

sch_students

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: School Name, dtype: int64

In [21]:
#each school budget
sch_budget = grouped_school['School Budget'].sum() / sch_students

sch_budget

Bailey High School       3124928.0
Cabrera High School      1081356.0
Figueroa High School     1884411.0
Ford High School         1763916.0
Griffin High School       917500.0
Hernandez High School    3022020.0
Holden High School        248087.0
Huang High School        1910635.0
Johnson High School      3094650.0
Pena High School          585858.0
Rodriguez High School    2547363.0
Shelton High School      1056600.0
Thomas High School       1043130.0
Wilson High School       1319574.0
Wright High School       1049400.0
dtype: float64

In [22]:
#calculate per student budget per school
sch_student_budget = sch_budget / sch_students

sch_student_budget

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [23]:
#calculate school % passing math
sch_pass_math = (renamed_columns[renamed_columns['Math Score'] >= 70].groupby('School Name')['Math Score'].count()) * 100 / sch_students
sch_pass_math

Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
dtype: float64

In [24]:
#calculate school % passing reading
sch_pass_reading = (renamed_columns[renamed_columns['Reading Score'] >= 70].groupby('School Name')['Reading Score'].count()) * 100 / sch_students
sch_pass_reading

Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
dtype: float64

In [25]:
#calculate school % overall passing
sch_pass_overall = (sch_pass_math + sch_pass_reading) / 2
sch_pass_overall

Bailey High School       74.306672
Cabrera High School      95.586652
Figueroa High School     73.363852
Ford High School         73.804308
Griffin High School      95.265668
Hernandez High School    73.807983
Holden High School       94.379391
Huang High School        73.500171
Johnson High School      73.639992
Pena High School         95.270270
Rodriguez High School    73.293323
Shelton High School      94.860875
Thomas High School       95.290520
Wilson High School       95.203679
Wright High School       94.972222
dtype: float64

In [26]:
#capture school avg math & reading scores
math_reading_scores = avg_scores.loc[:,['Math Score', 'Reading Score']]
math_reading_scores

                       Math Score  Reading Score
School Name
Bailey High School      77.048432      81.033963
Cabrera High School     83.061895      83.975780
Figueroa High School    76.711767      81.158020
Ford High School        77.102592      80.746258
Griffin High School     83.351499      83.816757
Hernandez High School   77.289752      80.934412
Holden High School      83.803279      83.814988
Huang High School       76.629414      81.182722
Johnson High School     77.072464      80.966394
Pena High School        83.839917      84.044699
Rodriguez High School   76.842711      80.744686
Shelton High School     83.359455      83.725724
Thomas High School      83.418349      83.848930
Wilson High School      83.274201      83.989488
Wright High School      83.682222      83.955000

In [27]:
#rename math and reading column
raw_school_summary = math_reading_scores.rename(columns={'Math Score': 'Average Math Score', 
                                                         'Reading Score': 'Average Reading Score'})

raw_school_summary.head()

                      Average Math Score  Average Reading Score
School Name
Bailey High School             77.048432              81.033963
Cabrera High School            83.061895              83.975780
Figueroa High School           76.711767              81.158020
Ford High School               77.102592              80.746258
Griffin High School            83.351499              83.816757

In [28]:
#capture school type
raw_sch_type = school_df.loc[:,['school_name', 'type']]

raw_sch_type.head()

             school_name      type
0      Huang High School  District
1   Figueroa High School  District
2    Shelton High School   Charter
3  Hernandez High School  District
4    Griffin High School   Charter

In [29]:
#rename and set index to school name
renamed_raw_sch_type = raw_sch_type.rename(columns={'school_name': 'School Name'})

sch_type = renamed_raw_sch_type.set_index('School Name')

sch_type.head()

                           type
School Name
Huang High School      District
Figueroa High School   District
Shelton High School     Charter
Hernandez High School  District
Griffin High School     Charter

In [30]:
#create school summary dataframe
raw_school_summary['Total Students'] = sch_students
raw_school_summary['Total Budget'] = sch_budget
raw_school_summary['Per Student Budget'] = sch_student_budget
raw_school_summary['% Passing Math'] = sch_pass_math
raw_school_summary['% Passing Reading'] = sch_pass_reading
raw_school_summary['% Overall Passing'] = sch_pass_overall
raw_school_summary['School Type'] = sch_type

raw_school_summary.head()

,Average Math Score,Average Reading Score,Total Students,Total Budget,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing,School Type
School Name,,,,,,,,,
Bailey High School,77.048432,81.033963,4976,3124928.0,628.0,66.680064,81.933280,74.306672,District
Cabrera High School,83.061895,83.975780,1858,1081356.0,582.0,94.133477,97.039828,95.586652,Charter
Figueroa High School,76.711767,81.158020,2949,1884411.0,639.0,65.988471,80.739234,73.363852,District
Ford High School,77.102592,80.746258,2739,1763916.0,644.0,68.309602,79.299014,73.804308,District
Griffin High School,83.351499,83.816757,1468,917500.0,625.0,93.392371,97.138965,95.265668,Charter

In [31]:
#reorganize df to make sense
school_summary = raw_school_summary[['School Type', 'Total Students', 'Total Budget', 
                                     'Per Student Budget','Average Math Score', 'Average Reading Score', 
                                     '% Passing Math', '% Passing Reading', '% Overall Passing']]

school_summary.head()

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Bailey High School,District,4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,Charter,1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,District,2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,District,2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,Charter,1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,95.265668

In [32]:
##final dataframe for school summary breakdown
#format columns
school_summary['Total Students'] = school_summary['Total Students'].map('{:,}'.format)
school_summary['Total Budget'] = school_summary['Total Budget'].map('${:,.2f}'.format)
school_summary['Per Student Budget'] = school_summary['Per Student Budget'].map('${:,.2f}'.format)
school_summary['Average Math Score'] = school_summary['Average Math Score'].map('{:.2f}'.format)
school_summary['Average Reading Score'] = school_summary['Average Reading Score'].map('{:.2f}'.format)
school_summary['% Passing Math'] = school_summary['% Passing Math'].map('{:.2f}%'.format)
school_summary['% Passing Reading'] = school_summary['% Passing Reading'].map('{:.2f}%'.format)
school_summary['% Overall Passing'] = school_summary['% Overall Passing'].map('{:.2f}%'.format)

school_summary

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Bailey High School,District,"4,976","$3,124,928.00",$628.00,77.05,81.03,66.68%,81.93%,74.31%
Cabrera High School,Charter,"1,858","$1,081,356.00",$582.00,83.06,83.98,94.13%,97.04%,95.59%
Figueroa High School,District,"2,949","$1,884,411.00",$639.00,76.71,81.16,65.99%,80.74%,73.36%
Ford High School,District,"2,739","$1,763,916.00",$644.00,77.10,80.75,68.31%,79.30%,73.80%
Griffin High School,Charter,"1,468","$917,500.00",$625.00,83.35,83.82,93.39%,97.14%,95.27%
Hernandez High School,District,"4,635","$3,022,020.00",$652.00,77.29,80.93,66.75%,80.86%,73.81%
Holden High School,Charter,427,"$248,087.00",$581.00,83.80,83.81,92.51%,96.25%,94.38%
Huang High School,District,"2,917","$1,910,635.00",$655.00,76.63,81.18,65.68%,81.32%,73.50%
Johnson High School,District,"4,761","$3,094,650.00",$650.00,77.07,80.97,66.06%,81.22%,73.64%
Pena High School,Charter,962,"$585,858.00",$609.00,83.84,84.04,94.59%,95.95%,95.27%
Rodriguez High School,District,"3,999","$2,547,363.00",$637.00,76.84,80.74,66.37%,80.22%,73.29%
Shelton High School,Charter,"1,761","$1,056,600.00",$600.00,83.36,83.73,93.87%,95.85%,94.86%
Thomas High School,Charter,"1,635","$1,043,130.00",$638.00,83.42,83.85,93.27%,97.31%,95.29%
Wilson High School,Charter,"2,283","$1,319,574.00",$578.00,83.27,83.99,93.87%,96.54%,95.20%
Wright High School,Charter,"1,800","$1,049,400.00",$583.00,83.68,83.95,93.33%,96.61%,94.97%

In [33]:
#final dataframe for top 5 performing schools based on overall passing rate
top_performers = school_summary.sort_values('% Overall Passing', ascending=False)

top_performers.head()

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Cabrera High School,Charter,"1,858","$1,081,356.00",$582.00,83.06,83.98,94.13%,97.04%,95.59%
Thomas High School,Charter,"1,635","$1,043,130.00",$638.00,83.42,83.85,93.27%,97.31%,95.29%
Griffin High School,Charter,"1,468","$917,500.00",$625.00,83.35,83.82,93.39%,97.14%,95.27%
Pena High School,Charter,962,"$585,858.00",$609.00,83.84,84.04,94.59%,95.95%,95.27%
Wilson High School,Charter,"2,283","$1,319,574.00",$578.00,83.27,83.99,93.87%,96.54%,95.20%

In [34]:
#final dataframe for bottom 5 performing schools based on overall passing
bottom_performers = school_summary.sort_values('% Overall Passing')

bottom_performers.head()

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Rodriguez High School,District,"3,999","$2,547,363.00",$637.00,76.84,80.74,66.37%,80.22%,73.29%
Figueroa High School,District,"2,949","$1,884,411.00",$639.00,76.71,81.16,65.99%,80.74%,73.36%
Huang High School,District,"2,917","$1,910,635.00",$655.00,76.63,81.18,65.68%,81.32%,73.50%
Johnson High School,District,"4,761","$3,094,650.00",$650.00,77.07,80.97,66.06%,81.22%,73.64%
Ford High School,District,"2,739","$1,763,916.00",$644.00,77.10,80.75,68.31%,79.30%,73.80%

In [35]:
#capture 9th, 10th, 11th, 12th grade math data
#9th grade math
raw_math_nine = renamed_columns.loc[renamed_columns['Grade'] == '9th']
raw_math_nine = raw_math_nine[['School Name', 'Math Score']]

#10th grade math
raw_math_tenth = renamed_columns.loc[renamed_columns['Grade'] == '10th']
raw_math_tenth = raw_math_tenth[['School Name', 'Math Score']]

#11th grade math
raw_math_eleventh = renamed_columns.loc[renamed_columns['Grade'] == '11th']
raw_math_eleventh = raw_math_eleventh[['School Name', 'Math Score']]

#12th grade math
raw_math_twelveth = renamed_columns.loc[renamed_columns['Grade'] == '12th']
raw_math_twelveth = raw_math_twelveth[['School Name', 'Math Score']]

In [36]:
#groupby school name & label column
#9th
group_math_nine = raw_math_nine.groupby('School Name').mean()
group_math_nine = group_math_nine.rename(columns={'Math Score':'9th'})

#10th
group_math_tenth = raw_math_tenth.groupby('School Name').mean()
group_math_tenth = group_math_tenth.rename(columns={'Math Score':'10th'})

#11th
group_math_eleventh = raw_math_eleventh.groupby('School Name').mean()
group_math_eleventh = group_math_eleventh.rename(columns={'Math Score':'11th'})

#12th
group_math_twelveth = raw_math_twelveth.groupby('School Name').mean()
group_math_twelveth = group_math_twelveth.rename(columns={'Math Score':'12th'})

In [37]:
#create dataframe for math scores by school each grade
math_score_summary = group_math_nine
math_score_summary['10th'] = group_math_tenth
math_score_summary['11th'] = group_math_eleventh
math_score_summary['12th'] = group_math_twelveth

math_score_summary

                             9th       10th       11th       12th
School Name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [38]:
##final dataframe for math score summary breakdown
#format dataframe
math_score_summary['9th'] = math_score_summary['9th'].map('{:.2f}'.format)
math_score_summary['10th'] = math_score_summary['10th'].map('{:.2f}'.format)
math_score_summary['11th'] = math_score_summary['11th'].map('{:.2f}'.format)
math_score_summary['12th'] = math_score_summary['12th'].map('{:.2f}'.format)

math_score_summary

                         9th   10th   11th   12th
School Name
Bailey High School     77.08  77.00  77.52  76.49
Cabrera High School    83.09  83.15  82.77  83.28
Figueroa High School   76.40  76.54  76.88  77.15
Ford High School       77.36  77.67  76.92  76.18
Griffin High School    82.04  84.23  83.84  83.36
Hernandez High School  77.44  77.34  77.14  77.19
Holden High School     83.79  83.43  85.00  82.86
Huang High School      77.03  75.91  76.45  77.23
Johnson High School    77.19  76.69  77.49  76.86
Pena High School       83.63  83.37  84.33  84.12
Rodriguez High School  76.86  76.61  76.40  77.69
Shelton High School    83.42  82.92  83.38  83.78
Thomas High School     83.59  83.09  83.50  83.50
Wilson High School     83.09  83.72  83.20  83.04
Wright High School     83.26  84.01  83.84  83.64

In [39]:
#capture 9th, 10th, 11th, 12th grade reading data
#9th grade math
raw_reading_nine = renamed_columns.loc[renamed_columns['Grade'] == '9th']
raw_reading_nine = raw_reading_nine[['School Name', 'Reading Score']]

#10th grade math
raw_reading_ten = renamed_columns.loc[renamed_columns['Grade'] == '10th']
raw_reading_ten = raw_reading_ten[['School Name', 'Reading Score']]

#11th grade math
raw_reading_eleven = renamed_columns.loc[renamed_columns['Grade'] == '11th']
raw_reading_eleven = raw_reading_eleven[['School Name', 'Reading Score']]

#12th grade math
raw_reading_twelve = renamed_columns.loc[renamed_columns['Grade'] == '12th']
raw_reading_twelve = raw_reading_twelve[['School Name', 'Reading Score']]

In [40]:
#groupby school name & label column
#9th
group_reading_nine = raw_reading_nine.groupby('School Name').mean()
group_reading_nine = group_reading_nine.rename(columns={'Reading Score':'9th'})

#10th
group_reading_ten = raw_reading_ten.groupby('School Name').mean()
group_reading_ten = group_reading_ten.rename(columns={'Reading Score':'10th'})

#11th
group_reading_eleven = raw_reading_eleven.groupby('School Name').mean()
group_reading_eleven = group_reading_eleven.rename(columns={'Reading Score':'11th'})

#12th
group_reading_twelve = raw_reading_twelve.groupby('School Name').mean()
group_reading_twelve = group_reading_twelve.rename(columns={'Reading Score':'12th'})

In [41]:
#create dataframe for math scores by school each grade
reading_score_summary = group_reading_nine
reading_score_summary['10th'] = group_reading_ten
reading_score_summary['11th'] = group_reading_eleven
reading_score_summary['12th'] = group_reading_twelve

reading_score_summary

                             9th       10th       11th       12th
School Name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [42]:
##final dataframe for reading score summary breakdown
#format dataframe
reading_score_summary['9th'] = reading_score_summary['9th'].map('{:.2f}'.format)
reading_score_summary['10th'] = reading_score_summary['10th'].map('{:.2f}'.format)
reading_score_summary['11th'] = reading_score_summary['11th'].map('{:.2f}'.format)
reading_score_summary['12th'] = reading_score_summary['12th'].map('{:.2f}'.format)

reading_score_summary

                         9th   10th   11th   12th
School Name
Bailey High School     81.30  80.91  80.95  80.91
Cabrera High School    83.68  84.25  83.79  84.29
Figueroa High School   81.20  81.41  80.64  81.38
Ford High School       80.63  81.26  80.40  80.66
Griffin High School    83.37  83.71  84.29  84.01
Hernandez High School  80.87  80.66  81.40  80.86
Holden High School     83.68  83.32  83.82  84.70
Huang High School      81.29  81.51  81.42  80.31
Johnson High School    81.26  80.77  80.62  81.23
Pena High School       83.81  83.61  84.34  84.59
Rodriguez High School  80.99  80.63  80.86  80.38
Shelton High School    84.12  83.44  84.37  82.78
Thomas High School     83.73  84.25  83.59  83.83
Wilson High School     83.94  84.02  83.76  84.32
Wright High School     83.83  83.81  84.16  84.07

In [43]:
#create bins for groupby school spending
bins = [0, 585, 615, 645, 675]

group_names = ['<$585', '$585-615', '$615-645', '$645-675']

In [44]:
#hold raw school summary in new var
raw_student_spend = raw_school_summary

#add column with bin labels
raw_student_spend["Per Student $ Summary"] = pd.cut(raw_student_spend["Per Student Budget"], bins, labels=group_names)
raw_student_spend.head()

,Average Math Score,Average Reading Score,Total Students,Total Budget,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing,School Type,Per Student $ Summary
School Name,,,,,,,,,,
Bailey High School,77.048432,81.033963,4976,3124928.0,628.0,66.680064,81.933280,74.306672,District,$615-645
Cabrera High School,83.061895,83.975780,1858,1081356.0,582.0,94.133477,97.039828,95.586652,Charter,<$585
Figueroa High School,76.711767,81.158020,2949,1884411.0,639.0,65.988471,80.739234,73.363852,District,$615-645
Ford High School,77.102592,80.746258,2739,1763916.0,644.0,68.309602,79.299014,73.804308,District,$615-645
Griffin High School,83.351499,83.816757,1468,917500.0,625.0,93.392371,97.138965,95.265668,Charter,$615-645

In [45]:
#groupby per student bins
raw_spend_summary = raw_student_spend.groupby('Per Student $ Summary')
raw_spend_summary.mean()

,Average Math Score,Average Reading Score,Total Students,Total Budget,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing
Per Student $ Summary,,,,,,,,
<$585,83.455399,83.933814,1592.000000,9.246042e+05,581.000000,93.460096,96.610877,95.035486
$585-615,83.599686,83.885211,1361.500000,8.212290e+05,604.500000,94.230858,95.900287,95.065572
$615-645,79.079225,81.891436,2961.000000,1.880208e+06,635.166667,75.668212,86.106569,80.887391
$645-675,76.997210,81.027843,4104.333333,2.675768e+06,652.333333,66.164813,81.133951,73.649382

In [46]:
#keep the needed columns
sch_spend_summary = raw_spend_summary[['Average Math Score', 'Average Reading Score', 
                                       '% Passing Math', '% Passing Reading', '% Overall Passing']].mean()

sch_spend_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Per Student $ Summary,,,,,
<$585,83.455399,83.933814,93.460096,96.610877,95.035486
$585-615,83.599686,83.885211,94.230858,95.900287,95.065572
$615-645,79.079225,81.891436,75.668212,86.106569,80.887391
$645-675,76.997210,81.027843,66.164813,81.133951,73.649382

In [47]:
##final dataframe for school per student spending summary breakdown
#format dataframe
sch_spend_summary['Average Math Score'] = sch_spend_summary['Average Math Score'].map('{:.2f}'.format)
sch_spend_summary['Average Reading Score'] = sch_spend_summary['Average Reading Score'].map('{:.2f}'.format)
sch_spend_summary['% Passing Math'] = sch_spend_summary['% Passing Math'].map('{:.2f}%'.format)
sch_spend_summary['% Passing Reading'] = sch_spend_summary['% Passing Reading'].map('{:.2f}%'.format)
sch_spend_summary['% Overall Passing'] = sch_spend_summary['% Overall Passing'].map('{:.2f}%'.format)

sch_spend_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Per Student $ Summary,,,,,
<$585,83.46,83.93,93.46%,96.61%,95.04%
$585-615,83.60,83.89,94.23%,95.90%,95.07%
$615-645,79.08,81.89,75.67%,86.11%,80.89%
$645-675,77.00,81.03,66.16%,81.13%,73.65%

In [48]:
#create bins for school size
bins = [0, 1000, 2000, 5000]

bin_label = ['Small (<1000)', 'Medium (1000-2000)', 'Large (2000-5000)']

In [49]:
#hold raw school summary in new var
raw_school_size = raw_school_summary

raw_school_size["School Size Summary"] = pd.cut(raw_school_size["Total Students"], bins, labels=bin_label)
raw_school_size.head()

,Average Math Score,Average Reading Score,Total Students,Total Budget,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing,School Type,Per Student $ Summary,School Size Summary
School Name,,,,,,,,,,,
Bailey High School,77.048432,81.033963,4976,3124928.0,628.0,66.680064,81.933280,74.306672,District,$615-645,Large (2000-5000)
Cabrera High School,83.061895,83.975780,1858,1081356.0,582.0,94.133477,97.039828,95.586652,Charter,<$585,Medium (1000-2000)
Figueroa High School,76.711767,81.158020,2949,1884411.0,639.0,65.988471,80.739234,73.363852,District,$615-645,Large (2000-5000)
Ford High School,77.102592,80.746258,2739,1763916.0,644.0,68.309602,79.299014,73.804308,District,$615-645,Large (2000-5000)
Griffin High School,83.351499,83.816757,1468,917500.0,625.0,93.392371,97.138965,95.265668,Charter,$615-645,Medium (1000-2000)

In [50]:
#groupby school size summary
raw_school_size_summary = raw_school_size.groupby('School Size Summary')
raw_school_size_summary.mean()

,Average Math Score,Average Reading Score,Total Students,Total Budget,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing
School Size Summary,,,,,,,,
Small (<1000),83.821598,83.929843,694.500,416972.500,595.000,93.550225,96.099437,94.824831
Medium (1000-2000),83.374684,83.864438,1704.400,1029597.200,605.600,93.599695,96.790680,95.195187
Large (2000-5000),77.746417,81.344493,3657.375,2333437.125,635.375,69.963361,82.766634,76.364998

In [51]:
#keep the needed columns
sch_size_summary = raw_school_size_summary[['Average Math Score', 'Average Reading Score', 
                                       '% Passing Math', '% Passing Reading', '% Overall Passing']].mean()

sch_size_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size Summary,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,94.824831
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,95.195187
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,76.364998

In [52]:
##final dataframe for school size summary breakdown
#format dataframe
sch_size_summary['Average Math Score'] = sch_size_summary['Average Math Score'].map('{:.2f}'.format)
sch_size_summary['Average Reading Score'] = sch_size_summary['Average Reading Score'].map('{:.2f}'.format)
sch_size_summary['% Passing Math'] = sch_size_summary['% Passing Math'].map('{:.2f}%'.format)
sch_size_summary['% Passing Reading'] = sch_size_summary['% Passing Reading'].map('{:.2f}%'.format)
sch_size_summary['% Overall Passing'] = sch_size_summary['% Overall Passing'].map('{:.2f}%'.format)

sch_size_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size Summary,,,,,
Small (<1000),83.82,83.93,93.55%,96.10%,94.82%
Medium (1000-2000),83.37,83.86,93.60%,96.79%,95.20%
Large (2000-5000),77.75,81.34,69.96%,82.77%,76.36%

In [53]:
#group merged data by type
sch_type = renamed_columns.groupby(['School Type'])
sch_type.mean()

,School ID,School Size,School Budget,Student ID,Reading Score,Math Score
School Type,,,,,,
Charter,6.964163,1717.352468,1.024543e+06,19438.475398,83.902821,83.406183
District,6.984505,4063.261195,2.611175e+06,19650.507711,80.962485,76.987026

In [54]:
#grab avg math and reading score columns
sch_type_summary = sch_type['Math Score', 'Reading Score'].mean()
sch_type_summary

             Math Score  Reading Score
School Type
Charter       83.406183      83.902821
District      76.987026      80.962485

In [55]:
#count of students by type
type_student = renamed_columns['School Type'].value_counts()
type_student

District    26976
Charter     12194
Name: School Type, dtype: int64

In [56]:
#percent pass math by type
type_pass_math = (renamed_columns[renamed_columns['Math Score'] >= 70].groupby('School Type')['Math Score'].count()) * 100 / type_student
type_pass_math

Charter     93.701821
District    66.518387
dtype: float64

In [57]:
#percent pass reading by type
type_pass_reading = (renamed_columns[renamed_columns['Reading Score'] >= 70].groupby('School Type')['Reading Score'].count()) * 100 / type_student
type_pass_reading

Charter     96.645891
District    80.905249
dtype: float64

In [58]:
#percent pass overall by type
type_pass_overall = (type_pass_math + type_pass_reading) / 2
type_pass_overall

Charter     95.173856
District    73.711818
dtype: float64

In [59]:
#type dataframe
sch_type_summary['% Passing Math'] = type_pass_math
sch_type_summary['% Passing Reading'] = type_pass_reading
sch_type_summary['% Overall Passing'] = type_pass_overall

sch_type_summary

,Math Score,Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.406183,83.902821,93.701821,96.645891,95.173856
District,76.987026,80.962485,66.518387,80.905249,73.711818

In [60]:
#rename columns
type_summary = sch_type_summary.rename(columns={'Math Score': 'Average Math Score',
                                                'Reading Score': 'Average Reading Score'})

type_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.406183,83.902821,93.701821,96.645891,95.173856
District,76.987026,80.962485,66.518387,80.905249,73.711818

In [61]:
##final dataframe for school type breakdown
#format dataframe
type_summary['Average Math Score'] = type_summary['Average Math Score'].map('{:.2f}'.format)
type_summary['Average Reading Score'] = type_summary['Average Reading Score'].map('{:.2f}'.format)
type_summary['% Passing Math'] = type_summary['% Passing Math'].map('{:.2f}%'.format)
type_summary['% Passing Reading'] = type_summary['% Passing Reading'].map('{:.2f}%'.format)
type_summary['% Overall Passing'] = type_summary['% Overall Passing'].map('{:.2f}%'.format)

type_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.41,83.90,93.70%,96.65%,95.17%
District,76.99,80.96,66.52%,80.91%,73.71%